cases/multiphaseEjector/VOF_OF13/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volScalarField;
    location        "0.64";
    object          nut.water;
}

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inletMain
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inletSecondary
    {
        type            calculated;
        value           uniform 0;
    }
    wallNozzle1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wallNozzle2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wallDiffuser
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
