cases/multiphaseEjector/VOF_OF13/system/patchAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average values of fields on a patch.

\*---------------------------------------------------------------------------*/

patch   inletMain;

fields  (p);

operation areaAverage;

#includeEtc "caseDicts/functions/surfaceFieldValue/patchValue.cfg"

// ************************************************************************* //
